Repository: thisirs/guv
Catalog: src/guv/locale/*/LC_MESSAGES/guv.po
Languages: fr

source: First message to {email}: {message}
fr: Premier message à {email} : {message}

source: Send the {n} emails? (y/n)
fr: Envoyer les {n} courriels ? (y/n)

source: Password:
fr: Mot de passe :

source: The column `%s` does not exist in the central file, it will be empty in the created file
fr: La colonne `%s` n'existe pas dans le fichier central, elle sera vide dans le fichier créé

source: The task `{task_name}` failed: {e}
fr: La tâche `{task_name}` a échoué : {e}

source: No UV/UE specified in the `UVS` variable
fr: Aucune UV/UE renseignée dans la variables `UVS`

source: Name of the grade sheet
fr: Nom de la feuille de notes

source: Configuration file
fr: Fichier de configuration

source: {config_help} `{config_file}` not found
fr: {config_help} `{config_file}` non trouvé

source: Configuration files
fr: Fichiers de configuration

source: How many configuration files?
fr: Combien de fichiers de configuration ?

source: Configuration file {i}
fr: Fichier de configuration {i}

source: Columns `{name_col}` and `{lastname_col}` are required
fr: Il faut des colonnes `{name_col}` et `{lastname_col}`

source: The columns {msg} are required and cannot be removed
fr: Les colonnes {msg} sont nécessaires et ne peuvent pas être supprimées

source: The keys {inter_msg} are required and cannot be renamed
fr: Les clés {inter_msg} sont requises et ne peuvent pas être renommées
