Repository: thisirs/guv
Catalog: src/guv/locale/*/LC_MESSAGES/guv.po
Languages: fr

source: Column already exists: {common_cols}
fr: Colonne{s} déjà existante{s}: {common_cols}

source: Column already exists: {common_cols} in the dataframe from the file `{origin}`
fr: Colonne{s} déjà existante{s}: {common_cols} dans le dataframe issu du fichier `{origin}`

source: Missing column: {missing_cols}. Available columns: {avail_cols}
fr: Colonne manquante: {missing_cols}. Colonnes disponibles: {avail_cols}

source: Missing column: {missing_cols} in the dataframe from the file `{origin}`. Available columns: {avail_cols}
fr: Colonne manquante: {missing_cols} dans le dataframe issu du fichier `{origin}`. Colonnes disponibles: {avail_cols}

source: Only one of the options `na_value` and `group_column` must be specified
fr: Une seule des options `na_value` et `group_column` doit être spécifiée

source: The column `%s` contains empty entries
fr: La colonne `%s` contient des entrées vides

source: No non-NA value in the group `%s`
fr: Aucune valeur non-NA dans le groupe `%s`

source: Multiple non-NA and different values in the group `%s`
fr: Plusieurs valeurs non-NA et différentes dans le groupe `%s`

source: Replace NAs in the column `{colname}` with the value `{na_value}`
fr: Remplace les NA dans la colonne `{colname}` par la valeur `{na_value}`

source: Replace NAs in the column `{colname}` by grouping by `{group_column}`
fr: Remplace les NA dans la colonne `{colname}` en groupant par `{group_column}`

source: The arguments `backup` and `new_colname` are incompatible.
fr: Les arguments `backup` et `new_colname` sont incompatibles.

source: Regex replacement in column `{colname}`
fr: Remplacement regex dans colonne `{colname}`

source: Regex replacement in column `{colname}` to column `{new_colname}`
fr: Remplacement regex dans colonne `{colname}` vers colonne `{new_colname}`

source: Replacement in column `{colname}`
fr: Remplacement dans colonne `{colname}`

source: Replacement in column `{colname}` to column `{new_colname}`
fr: Replacement dans colonne `{colname}` vers colonne `{new_colname}`

source: Apply a function to the Dataframe
fr: Appliquer une fonction au Dataframe

source: Apply a function to the column `{colname}`
fr: Appliquer une fonction à la colonne `{colname}`

source: Calculation of the column `{colname}`
fr: Calcul de la colonne `{colname}`

source: Email address `{email}` appears multiple times
fr: Adresse courriel `{email}` présente plusieurs fois

source: Email address `{email}` not present in the central file
fr: Adresse courriel `{email}` non présente dans le fichier central

source: Student named `{name}` appears multiple times
fr: Étudiant de nom `{name}` présent plusieurs fois

source: Student named `{name}` not present or recognized in the central file
fr: Étudiant de nom `{name}` non présent ou reconnu dans le fichier central

source: Modification of the column `{colname}` for the identifier `{name_or_email}`
fr: Modification de la colonne `{colname}` pour l'identifiant `{name_or_email}`

source: Aggregation of the file `{filename}`
fr: Agrégation du fichier `{filename}`

source: An aggregation function must be provided
fr: Il faut fournir une fonction d'agrégation

source: Either `on`, or `left_on` and `right_on` must be specified.
fr: On doit spécifier soit `on`, soit `left_on` et `right_on`.

source: `left_on` and `right_on` must both be from `id_slug`
fr: `left_on` et `right_on` doivent être simultanément issus de `id_slug`

source: The `{login_col}` column or the `{lastname_column}` and `{name_column}` columns are required
fr: La colonne `{login_col}` ou les colonnes `{lastname_column}` et `{name_column}` sont requises

source: Add manual columns: {msg}
fr: Ajoute les colonnes manuelles : {msg}

source: Direct aggregation of `{string}`
fr: Agrégation directe de `{string}`

source: No match for `{:s}`
fr: Pas de correspondance pour `{:s}`

source: Multiple matches for `{:s}`
fr: Plusieurs correspondances pour `{:s}`

source: Aggregation of the exchange file `{filename}`
fr: Agrégation du fichier d'échanges `{filename}`

source: Direct aggregation of exchanges `{string}`
fr: Agrégation directe des échanges `{string}`

source: Incorrect line: `{line}`. Expected format `etu1 --- etu2`.
fr: Ligne incorrecte: `{line}`. Format `etu1 --- etu2` attendu.

source: Exchange of `{nom1}` and `{nom2}` in the column `{colname}`
fr: Échange de `{nom1}` et `{nom2}` dans la colonne `{colname}`

source: Student `{nom}` assigned to group `{idx}`
fr: Étudiant(e) `{nom}` affecté(e) au groupe `{idx}`

source: Abandon student `%s`
fr: Abandon étudiant(e) `%s`

source: The backup of the column `%s` is activated but it is not present in the central file
fr: Le backup de la colonne `%s` est activé mais elle n'est pas présente dans le fichier central

source: Aggregation of the group file `{filename}`
fr: Agrégation du fichier de groupes `{filename}`

source: Aggregated grade
fr: Note agrégée

source: ECTS grade
fr: Note ECTS

source: Error in `{m}`:
fr: Erreur dans `{m}` :

source: The following record is not unique
fr: L'enregistrement suivant n'est pas unique

source: `%s` is not present in the Moodle data
fr: `%s` n'est pas présent dans les données Moodle

source: Searching for match for `%s` :
fr: Recherche de correspondance pour `%s` :

source: Choice? (enter if no match)
fr: Choix ? (entrée si pas de correspondance)

source: {n} record could not be incorporated into the central file
fr: {n} enregistrement n'a pas pu être incorporé au fichier central

source: Merge impossible
fr: Fusion impossible

source: Attempting to merge columns `{col1}` and `{col2}`
fr: Tentative de fusion des colonnes `{col1}` et `{col2}`

source: Merge impossible, keeping columns `{col1}` and `{col2}`
fr: Fusion impossible, on garde les colonnes `{col1}` et `{col2}`

source: The group named {grp} does not have a Moodle match in the MOODLE_GROUPS variable
fr: Le groupe nommé {grp} n'a pas de correspondance Moodle dans la variable MOODLE_GROUPS

source: Create a semester folder
fr: Crée un dossier de semestre

source: Creating folder %s
fr: Création du dossier %s

source: Creating file %s
fr: Création du fichier %s

source: The file %s already exists
fr: Le fichier %s existe déjà

source: The file `%s` already exists
fr: Le fichier `%s` existe déjà

source: Create UV folders
fr: Crée des dossiers d'UV

source: The file `{fn}` does not exist
fr: Le fichier `{fn}` n'existe pas

source: The planning `{plng}` does not have a key `UVS` or `UES`.
fr: Le planning `{plng}` n'a pas de clé `UVS` ou `UES`.

source: The UV `{uv}` is not recognized because it is not registered in the `UVS` variable.
fr: L'UV `{uv}` n'est pas reconnue car elle n'est pas enregistrée dans la variable `UVS`.

source: The folder for the UV {uv} does not exist.
fr: Le dossier pour l'UV {uv} n'existe pas.

source: The UV `{uv}` does not have an associated planning in `PLANNINGS`
fr: L'UV `{uv}` n'a pas de planning associé dans `PLANNINGS`

source: The UV `{uv}` has multiple associated plannings in `PLANNINGS`
fr: L'UV `{uv}` a plusieurs plannings associés dans `PLANNINGS`

source: The task must be executed in a UV/semester folder
fr: La tâche doit être exécutée dans un dossier d'UV/semestre

source: The task must be executed in a UV folder
fr: La tâche doit être exécutée dans un dossier d'UV

source: The file `{fn}` already exists.
fr: Le fichier `{fn}` existe déjà.

source: Overwrite (d), keep (g), save (s), cancel (a)?
fr: Écraser (d), garder (g), sauvegarder (s), annuler (a) ?

source: Cancellation
fr: Annulation

source: Backup to `%s`
fr: Sauvegarde vers `%s`

source: Overwriting the file `%s`
fr: Écrasement du fichier `%s`

source: Writing the file `%s`
fr: Écriture du fichier `%s`

source: Error in creating the .tex file:
fr: Erreur dans la création du fichier .tex :

source: Allows access to underlying sub-commands
fr: Permet d'avoir accès aux commandes doit sous-jacentes

source: Number or fraction not recognized
fr: Nombre ou fraction pas reconnu

source: The identifier `{name}` does not allow for a valid filename
fr: L'identifiant `{name}` ne permet pas d'avoir un nom de fichier valide

source: Excel or CSV file only
fr: Fichier Excel ou csv seulement

source: The 'UVS' variable is incorrect: a list of managed UVs is expected
fr: La variable 'UVS' est incorrecte : une liste des UV gérées est attendue

source: The 'PLANNINGS' variable is incorrect: it must be a dictionary whose keys are plannings and the values are a dictionary of properties
fr: La variable 'PLANNINGS' est incorrecte: il faut que ce soit un dictionnaire dont les clés sont des plannings et les valeurs un dictionnaire de propriétés

source: The 'DEBUG' variable is incorrect: an integer is expected
fr: La variable 'DEBUG' est incorrecte : un entier est attendu

source: Identifier of the UV/UE on Moodle
fr: Identifiant de l'UV/UE sur Moodle

source: Port for sending email
fr: Port pour l'envoi de courriel

source: SMTP server for sending email
fr: Serveur SMTP pour l'envoi de courriel

source: Origin email address of sent emails
fr: Adresse de courriel d'origine des courriels envoyés

source: Login for the SMTP server
fr: Login pour le server smtp

source: The variable `{name}` could not be found
fr: La variable `{name}` n'a pas pu être trouvée

source: Not in a UV/semester folder
fr: Pas dans un dossier d'UV/semestre

source: Problem loading file `{config_file}`:
fr: Problème de chargement du fichier `{config_file}`:

source: The step `{name}` failed: {e}
fr: L'étape `{name}` a échoué : {e}

source: The DOCS variable must be of type `Documents`: `DOCS = Documents()`
fr: La variable DOCS doit être de type `Documents`: `DOCS = Documents()`

source: The `config.py` file must contain a `DOCS` variable
fr: Le fichier `config.py` doit contenir une variable `DOCS`

source: The `DOCS` variable must be of type `Documents`
fr: La variable `DOCS` doit être de type `Documents`

source: `DOCS` must contain at least one operation
fr: `DOCS` doit contenir au moins une opération

source: Attendance sheet
fr: Feuille de présence

source: Specifies a title that will be used in the attendance sheets and the name of the generated file. By default, it is ``%(default)s``.
fr: Spécifie un titre qui sera utilisé dans les feuilles de présence et le nom du fichier généré. Par défaut, on a ``%(default)s``.

source: Allows creating groups to make as many attendance sheets. You must specify a column from the central file ``effectif.xlsx``.
fr: Permet de créer des groupes pour faire autant de feuilles de présence. Il faut spécifier une colonne du fichier central ``effectif.xlsx``.

source: Do not display the names of the students (useful only with --group).
fr: Ne pas faire apparaître le nom des étudiants (utile seulement avec --group).

source: Uses a list of staff instead of ``--group``. The group names can be specified by ``--names``. Otherwise, the group names are in the form ``Group 1``, ``Group 2``,...
fr: Utilise une liste d'effectifs au lieu de ``--group``. Le nom des groupes peut être spécifié par ``--names``. Sinon, les noms de groupe sont de la forme ``Groupe 1``, ``Groupe 2``,...

source: Specifies the names of the groups corresponding to ``--count``. The list must be the same size as ``--count``.
fr: Spécifie le nom des groupes correspondants à ``--count``. La liste doit être de même taille que ``--count``.

source: Allows adding additional empty lines in addition to those already present induced by ``--group`` or set by ``--count``.
fr: Permet de rajouter des lignes supplémentaires vides en plus de celles déjà présentes induites par ``--group`` ou fixées par ``--count``.

source: Extra time
fr: Tiers-temps

source: Specifies the column for students placed in a dedicated room. If the column is not specified, ``%(default)s``.
fr: Spécifie la colonne pour les étudiants placés dans une salle dédiée. Si colonne non spécifiée, ``%(default)s``.

source: Allows leaving the generated .tex files for possible modification.
fr: Permet de laisser les fichiers .tex générés pour modification éventuelle.

source: The options --group and --count are incompatible
fr: Les options --group et --count sont incompatibles

source: The options --count and --names must be of the same length
fr: Les options --count et --names doivent être de même longueur

source: Group_{i}
fr: Groupe_{i}

source: The column `{self.tiers_temps}` must contain only Yes/No
fr: La colonne `{self.tiers_temps}` doit contenir uniquement Oui/Non

source: Dedicated room
fr: Salle dédiée

source: Extra_time
fr: Tiers_temps

source: The cumulative numbers are not sufficient
fr: Les effectifs cumulés ne suffisent pas

source: The column `{tiers_temps}` must contain only Yes/No
fr: La colonne `{tiers_temps}` doit contenir uniquement Oui/Non

source: The number of names specified with --names is different from the number of groups
fr: Le nombres de noms spécifiés avec --names est différent du nombre de groupes

source: Allows specifying a group column to make attendance sheets by groups.
fr: Permet de spécifier une colonne de groupes pour faire des feuilles de présence par groupes.

source: Allows specifying the number of sessions for the semester, i.e., the number of columns in the attendance sheet.
fr: Permet de spécifier le nombre de séances pour le semestre c'est à dire le nombre de colonne dans la feuille de présence.

source: Template to set the name of successive sessions in the attendance sheet. By default, it is ``%(default)s``. The only supported keyword is ``number`` which starts at 1.
fr: Modèle permettant de fixer le nom des séances successives dans la feuille de présence. Par défaut on a ``%(default)s``. Le seul mot-clé supporté est ``number`` qui commence à 1.

source: Coefficients
fr: Coeffs

source: Files containing the detailed grading scales
fr: Fichiers contenant le ou les barèmes détaillés

source: How many grading scales?
fr: Combien de barèmes ?

source: Grading scale {i}
fr: Barème {i}

source: Name of a sub-part/question of `{item_name}` (nothing if question)?
fr: Nom d'une sous-partie/question de `{item_name}` (rien si question)?

source: Name of a part/question?
fr: Nom d'une partie/question ?

source: Name of another sub-part/question of `{item_name}`?
fr: Nom d'une autre sous-partie/question de `{item_name}` ?

source: Name of another part/question?
fr: Nom d'une autre partie/question ?

source: Points for the question `{item_name}`:
fr: Points pour la question `{item_name}` :

source: Coefficient for the question `{item_name}`:
fr: Coefficient pour la question `{item_name}` :

source: Constructed YAML file:
fr: Fichier YAML construit :

source: Validate? (y/n)
fr: Valider ? (y/n)

source: raw
fr: brut

source: Column used to order the names in each sheet
fr: Colonne utilisée pour ordonner les noms dans chaque feuille

source: Column used to group into multiple sheets
fr: Colonne utilisée pour grouper en plusieurs feuilles

source: Additional columns to include in the grade sheet
fr: Colonnes supplémentaires à inclure dans la feuille de notes

source: part {i}
fr: partie {i}

source: median
fr: médiane

source: Student {i}
fr: Étudiant {i}

source: Group column used to grade groups of students
fr: Colonne de groupes utilisée pour noter des groupes d'étudiants

source: Group {i}
fr: Groupe {i}

source: Configuration file specifying the grades to use
fr: Fichier de configuration spécifiant les notes à utiliser

source: Passed
fr: Admis

source: Passing grade
fr: Note admis

source: Indicate the columns containing grades to use directly for the final grade (SPACE: select, ENTER: validate):
fr: Indiquer les colonnes contenant des notes à utiliser directement pour la note finale (SPACE: sélectionner, ENTER: valider):

source: Add intermediate grades to use directly for the final grade and not present in the file ``effectif.xlsx``? (y/n)
fr: Ajouter des notes intermédiaires à utiliser directement pour la note finale et non présentes dans le fichier ``effectif.xlsx`` ? (y/n)

source: Name of the intermediate grade? (leave blank to finish)
fr: Nom de la note intermédiaire ? (laisser vide pour terminer)

source: Column already present
fr: Colonne déjà présente

source: Indicate other columns for information (project group, tutorial group,...):
fr: Indiquer d'autres colonnes pour information (groupe de projet, groupe de TD,...):

source: Percentile grade A
fr: Percentile note A

source: Percentile grade B
fr: Percentile note B

source: Percentile grade C
fr: Percentile note C

source: Percentile grade D
fr: Percentile note D

source: Parameters
fr: Paramètres

source: Median
fr: Médiane

source: Global options
fr: Options globales

source: Percentile grade
fr: Percentile note

source: {ects} if >=
fr: {ects} si >=

source: Theoretical percentiles
fr: Percentiles théoriques

source: Used percentiles
fr: Percentiles utilisés

source: Number of {ects}
fr: Nombre de {ects}

source: Number of passed
fr: Nombre d'admis

source: Total number
fr: Effectif total

source: Statistics
fr: Statistiques

source: A if >=
fr: A si >=

source: B if >=
fr: B si >=

source: C if >=
fr: C si >=

source: D if >=
fr: D si >=

source: List of groupings to consider via a column name. By default, the groupings ``Lecture``, ``Tutorial`` and ``Practical work`` are used.
fr: Liste des groupements à considérer via un nom de colonne. Par défaut, les groupements ``Cours``, ``TD`` et ``TP`` sont utilisés.

source: Use the names of Lecture/Tutorial/Practical work groups in long format, i.e., "TP1" and "TD1" instead of "T1" and "D1"
fr: Utiliser les noms de groupes de Cours/TD/TP au format long, c'est à dire "TP1" et "TD1" au lieu de "T1" et "D1"

source: Create a single file
fr: Créer un unique fichier

source: Value not defined in the column `{colname}` for the student {stu}
fr: Valeur non définie dans la colonne `{colname}` pour l'étudiant(e) {stu}

source: Number of groups in each grouping
fr: Nombre de groupes dans chaque groupement

source: Format of the group name (default: %(default)s)
fr: Format du nom de groupe (par défaut: %(default)s)

source: Number of different groupings
fr: Nombre de groupements différents

source: Format of the grouping name (default: %(default)s)
fr: Format du nom de groupement (par défaut: %(default)s)

source: Name of the column performing a grouping
fr: Nom de la colonne réalisant un groupement

source: Name associated with the set of created groups. Included in the name of the created file and in the name of the created groups following the used *template*.
fr: Nom associé à l'ensemble des groupes créés. Repris dans le nom du fichier créé et dans le nom des groupes créés suivant la *template* utilisée.

source: Pre-groups in which to make sub-groups
fr: Pré-groupes dans lesquels faire des sous-groupes

source: Number of groups to create (per sub-groups if specified)
fr: Nombre de groupes à créer (par sous-groupes si spécifié)

source: Group size: pairs, trios or more
fr: Taille des groupes : binômes, trinômes ou plus

source: List of proportions to create the groups
fr: Liste de proportions pour créer les groupes

source: Template to give names to the groups with `{title}`, `{grouping_name}` or `{group_name}`
fr: Modèle pour donner des noms aux groupes avec `{title}`, `{grouping_name}` ou `{group_name}`

source: List of keywords to build the group names
fr: Liste de mots clés pour construire les noms des groupes

source: Order the list of students alphabetically or by columns
fr: Ordonner la liste des étudiants par ordre alphabétique ou par colonnes

source: Do not reset the sequence of group names between each grouping
fr: Ne pas remettre à zéro la suite des noms de groupes entre chaque groupement

source: Randomly permute the group names
fr: Permuter aléatoirement les noms de groupes

source: List of columns of already formed groups that should not be reformed.
fr: Liste de colonnes de groupes déjà formés qui ne doivent plus être reformés.

source: List of columns of affinity groups.
fr: Liste de colonnes de groupes d'affinité.

source: Maximum number of attempts to find groups with constraints (default %(default)s).
fr: Nombre maximum d'essais pour trouver des groupes avec contraintes (par défaut %(default)s).

source: The template must contain either '@' or '#' to generate different group names
fr: La template doit contenir soit '@' soit '#' pour générer des noms de groupes différents

source: No # or @ in the template to generate different names
fr: Pas de # ou de @ dans la template pour générer des noms différents

source: The name file `{names}` does not exist
fr: Le fichier de noms `{names}` n'existe pas

source: No template specified. The default template is `%s`
fr: Pas de template spécifiée. La template par défaut est `%s`

source: Specify one and only one argument among --proportions, --group-size, --num-groups
fr: Spécifier un et un seul argument parmi --proportions, --group-size, --num-groups

source: Specify one and only one replacement in the template among `@`, `#` and `{group_name}`
fr: Spécifier un et un seul remplacement dans la template parmi `@`, `#` et `{group_name}`

source: The template contains '{group_name}' but --names is not specified
fr: La template contient '{group_name}' mais --names n'est pas spécifié

source: The template contains '{grouping_name}' but no grouping is specified with the --grouping option
fr: La template contient '{grouping_name}' mais aucun groupement n'est spécifié avec l'option --grouping

source: The template does not contain '{grouping_name}' but the --grouping option is active with resetting of group names
fr: La template ne contient pas '{grouping_name}' mais l'option --grouping est active avec remise à zéro des noms de groupes

source: The ``ordered`` option is incompatible with the constraints ``other-groups`` and ``affinity_groups``.
fr: L'option ``ordered`` est incompatible avec les contraintes ``other-groups`` et ``affinity_groups``.

source: The available group names are exhausted, use # or @ in the template or add names in `--names`.
fr: Les noms de groupes disponibles sont épuisés, utiliser # ou @ dans le modèle ou rajouter des noms dans `--names`.

source: Optimal partition for the group `{name}` found in {num_variants} attempts.
fr: Partition optimale pour le groupe `{name}` trouvée en {num_variants} essais.

source: Optimal partition found in {num_variants} attempts.
fr: Partition optimale trouvée en {num_variants} essais.

source: No optimal solution found for the group `{name}` in {max_iter} attempts, best solution:
fr: Pas de solution optimale trouvée pour le groupe `{name}` en {max_iter} essais, meilleure solution :

source: No optimal solution found in {max_iter} attempts, best solution:
fr: Pas de solution optimale trouvée en {max_iter} essais, meilleure solution :

source: - non-membership constraint by the column `{column}` violated {n_errors} times:
fr: - contrainte de non-appartenance par la colonne `{column}` violée {n_errors} fois :

source: - non-membership constraint by the column `{column}` verified
fr: - contrainte de non-appartenance par la colonne `{column}` vérifiée

source: - affinity constraint by the column `{column}` violated {n_errors} times:
fr: - contrainte d'affinité par la colonne `{column}` violée {n_errors} fois :

source: - affinity constraint by the column `{column}` verified
fr: - contrainte d'affinité par la colonne `{column}` vérifiée

source: The name of the group column
fr: Le nom de la colonne des groupes

source: The path to a Jinja2 template
fr: Le chemin vers un modèle au format Jinja2

source: The file {template} does not exist. Create? (y/n)
fr: Le fichier {template} n'existe pas. Créer ? (y/n)

source: Subject: subject body
fr: Subject: le sujet le corps

source: Message must start with "Subject:"
fr: Le message doit commencer par "Subject:"

source: No message to send
fr: Pas de message à envoyer
